1 Запитання . Система двох лінійних рівнянь з трьома невідомими завжди 
а) є не визначена або ж є не сумісна 

2 Запитання . Система { ax+by= c 1 ax+by= c 2   
а) може бути невизначеною 

3 Запитання . Система лінійних рівнянь з квадратною матрицею A   має нескінченну кількість розв’язків. Тоді визначник матриці A   повинен бути рівним… 
а) 0 

4 Запитання . Нехай ?  - детермінант матриці лінійної системи. Тоді 
а) якщо ? не=0  , то система сумісна 

5 Запитання . Якщо визначник матриці лінійної системи дорівнює нулеві, то система: 
а) не має розв’язків, або ж має їх нескінченну кількість 

6 Запитання . Система лінійних рівнянь { 2x-3y=4, 4x-?y=?+2,   має безліч розв’язків, якщо значення параметра ?   дорівнює 
а) 6 

7 Запитання . Якщо X1 та X2 - розв’язки системи лінійних рівнянь AX=B, B не= 0, то розв’язком цієї системи обов’язково буде 
а) 1/2 (X1 + X2)   

8 Запитання . Однорідна система лінійних рівнянь не може бути 
а) несумісною 

9 Запитання . Детермінант матриці завжди не зміниться, якщо 
а) транспонувати матрицю детермінанта 

10 Запитання . Якщо A,B - неособливі квадратні матриці n-го порядку, k-число, то завжди 
а) det(A^-1)= (det(A))^-1   

11 Запитання . Якщо детермінант n  -го порядку ( n>=3 )   дорівнює 0, то завжди 
а) його рядки (стовпці) лінійно залежні 

12 Запитання . До першого рядка детермінанта 5-го порядку додали суму чотирьох інших рядків, а останні не змінили. При цьому детермінант 
а) не зміниться 

13 Запитання . В детермінанті 5-го порядку рівно 21 елемент дорівнює 0. Цей детермінант дорівнює 
а) 0 

14 Запитання . Кількість перестановок на п’ятиелементній множині дорівнює 
а) 120 

15 Запитання . Стовпці a, b, c, d 4x4 –матриці А змінили за правилом a, c, d, b. детермінант матриці А: 
а) не змінився 

16 Запитання . Якщо А, В – квадратні матриці n-го порядку, k – число, то завжди 
а) det(AB)=detA*detB   

17 Запитання . До першого рядка детермінанта 5-го порядку додали суму чотирьох інших рядків. При цьому детермінант 
а) не зміниться 

18 Запитання . Кількість перестановок на п’ятиелементній множині дорівнює 
а) 120 

19 Запитання . Якщо в матриці змінити один з її елементів, то ранг матриці може збільшитись на 
а) 1 

20 Запитання . Кожна з матриць A та B   має ненульовий детермінант, тоді завжди ненульовий детермінант має матриця 
а) AB   

21 Запитання . Два стовпці квадратної матриці співпадають. Обернена для цієї матриці матриця 
а) не існує 

22 Запитання . Знайти добуток стобец( 1 2 3 )*строка( 1,-1,2 )   
а) ( 1 -1 2 2 -2 4 3 -3 6 )   

23 Запитання . Знайти квадратну матрицю X   другого порядку, для якої X столбец( 1 3 )=столбец( 1 6 )   
а) ( 1 0 0 2 )   

24 Запитання . Нехай H-(nХn)   - матриця, n>=2  . Рівняння XH=H   
а) має принаймні один розв’язок 

25 Запитання . Нехай A, B   - квадратні матриці n-го порядку, причому B- особлива матриця. Тоді завжди особливою є матриця 
а) AB^T   

26 Запитання . Матричне рівняння ( 1 1 1 1 )X=( 2 1 0 1 )   
а) не має розв’язків 

27 Запитання . Нехай A, B   - квадратні неособливі матриці n-го порядку. Тоді завжди 
а) (AB)^-1 = B^-1*A^-1   

28 Запитання . Ранг матриці ( 2 2 2 2 )   дорівнює 
а) 1 

29 Запитання . Кожна з матриць А та В має нульовий детермінант, тоді нульовий детермінант завжди має матриця 
а) АВ 

30 Запитання . Два стовпці квадратичної матриці протилежні. Обернена для цієї матриці 
а) не існує 

31 Запитання . Знайти добуток ( 1, -1, 2 )( 1 2 3 4 )   
а) помножити не можна 

32 Запитання . Нехай А, В є, відповідно, матриця-рядок і матриця-стовпець із 3 чисел. Тоді невизначеними є добуток 
а) B^2   

33 Запитання . Нехай А, В – квадратні матриці n-го порядку, причому, А – особлива матриця. Тоді завжди особливою є матриця 
а) A^T*B   

34 Запитання . Ранг матриці ( 1 2 0 0 )   дорівнює 
а) 1 

35 Запитання . При множенні 2x2   - матриці А зліва на матрицю ( 1 0 0 2 )  , тобто ( 1 0 0 2 )A  , в матриці А… 
а) другий рядок помножується на 2 

36 Запитання . Добуток двох матриць є ненульова матриця. Тоді 
а) обов’язково обидві матриці ненульові 

37 Запитання . Деяке комплексне число має тригонометричну форму 
а) 3(cos pi/6 +isin pi/6)   

38 Запитання . Множення комплексних чисел на мниме число i реалізує наступне перетворення координатної площини 
а) поворот навколо початку координат на кут 90   

39 Запитання . Комплексні числа z, які задовольняють умову { |z|<=1, 0<=arg z<=pi/4 ,   в координатній площині визначають 
а) сектор круга 

40 Запитання . Рівняння x^4+16=0   над полем комплексних чисел 
а) має рівно чотири розв’язки 

41 Запитання . Нехай z1=1-i, z2 =-1+i. Тоді 
а) |z1|=|z2|   

42 Запитання . Добуток комплексного числа z   на спряжене z|   є 
а) невід’ємне дійсне число 

43 Запитання . З того, що комплексне число z   співпадає з числом z|   випливає 
а) z   міститься на дійсній осі 

44 Запитання . Множині всіх комплексних чисел з аргументом pi/4   на комплексній площині відповідає 
а) промінь без початкової точки 

45 Запитання . Множення комплексних чисел на число –i реалізує наступне перетворення координатної площини 
а) поворот навколо початку координат на кут pi/2   за стрілкою годинника 

46 Запитання . Нехай z1=2+i, z2 =2-i  . Тоді 
а) z1 = z2|   

47 Запитання . Комплексні числа z, які задовольняють умові arg z= pi/2   в координатній площині визначають 
а) промінь без початкової точки 

48 Запитання . Кількість розв’язків рівняння x^4+1=0   над полем комплексних чисел дорівнює 
а) 4 

49 Запитання . Добуток комплексного числа z на число -z|   (z не=0)   є 
а) від’ємне дійсне число 

50 Запитання . Комплексні числа z, які задовiльняють на умову z=z|   в координатній площині визначають 
а) пряму 

51 Запитання . Многочлен четвертого степеня з дійсними коефіцієнтами не може мати 
а) три уявних і один дійсний корінь 

52 Запитання . Многочлен п’ятого степеня не може мати 
а) трьох різних кратних коренів 

53 Запитання . Незвідний над полем дійсних чисел многочлен не може мати степінь 
а) 3 

54 Запитання . Незвідний над полем комплексних чисел многочлен обов’язково має степінь 
а) 1 

55 Запитання . Лінійний простір дійсних многочленів степеня <=3 над полем дійсних чисел ізоморфний 
а) арифметичному простору R^4   

56 Запитання . Система n   векторів ( n>=2 )   є лінійно залежною тоді і лише тоді, коли 
а) один із векторів є лінійною комбінацією інших 

57 Запитання . Нехай u та w - підпростори лінійного чотиривимірного простору V  . Системи f1, f2, f3 та g1, g2 є базисами u та w відповідно. Система векторів f1, f2, f3, g1, g2 
а) лінійно залежна 

58 Запитання . Якщо ранг матриці однорідної системи лінійних рівнянь з 10-ма невідомими дорівнює 4, то вимірність простору її розв’язків дорівнює 
а) 6 

59 Запитання . Лінійний простір дійсних многочленів степеня =<2   над полем дійсних чисел має вимірність 
а) 3 

60 Запитання . Вимірність лінійного простору всіх верхньо трикутних 2x2 – матриць над полем дійсних чисел дорівнює: 
а) 3 

61 Запитання . Лінійний простір над полем дійсних чисел утворюють множини многочленів: 
а) степінь яких не перевершує n, включаючи 0 - многочлен 

62 Запитання . Вимірність суми двох підпросторів лінійного простору дорівнює сумі вимірностей доданків, якщо 
а) перетин доданків дорівнює нульовому елементу 

63 Запитання . Система з трьох векторів лінійно залежна тоді й лише тоді, коли 
а) хоча б один із векторів є лінійною комбінацією інших 

64 Запитання . Система із n векторів лінійно незалежна тоді і тільки тоді, коли 
а) лінійна комбінація векторів, де не всі коефіцієнти нульові, не може дорівнювати 0 

65 Запитання . Вектори a1,..,an утворюють базис лінійного простору, якщо 
а) вони лінійно незалежні і через них лінійно виражаються всі вектори простору 

66 Запитання . Вимірність лінійного простору дорівнює 
а) кількості векторів у максимальній лінійно незалежній підсистемі 

67 Запитання . У тривимірному дійсному лінійному просторі скалярний добуток задається 
а) нескінченною кількістю способів 

68 Запитання . Нехай x| =(x1, x2), y| =(y1, y2)  - довільні вектори арифметичного простору R^2. Скалярний добуток (x|, y|) в R^2 можна визначити формулою 
а) x1 y1 + x2 y2   

69 Запитання . У евклідовому просторі кожна ортонормована система векторів 
а) лінійно незалежна 

70 Запитання . Якщо вектори a| і b| мають довжину 4, то їх скалярний добуток не може дорівнювати 
а) 18 

71 Запитання . Нехай x| =(x1, x2), y| =(y1, y2) - довільні вектори арифметичного простору R^2. Скалярний добуток (x|, y|) в R^2   можна визначити формулою 
а) 2x1y1 + x2y2   

72 Запитання . Вектори a| і b| евклідового простору ортогональні тоді і тільки тоді, коли 
а) (a|, b|)=0   

73 Запитання . Якщо в евклідовому просторі (a|, b| )=0  , то 
а) a| перпендикулярна b|   

74 Запитання . Якщо в евклідовому просторі існують вектори a|, b|, c| такі, що (a|, c| )=(b|, c| ), то 
а) c| перпендикулярна (a| - b| )   

75 Запитання . Нехай x| =(x1, x2, x3)- довільний вектор арифметичного простору R^3. Формула 3x1 + x2 + x3^2   
а) не визначає квадратичну форму 

76 Запитання . Ранг квадратичної форми x1^2 +2x1x2 + x2^2   дорівнює 
а) 1 

77 Запитання . У двовимірному просторі додатньо визначеною є квадратична форма 
а) x1^2 +2x1x2 +2x2^2   

78 Запитання . Матриці А і В одного оператора в різних базисах завжди 
а) подібні 

79 Запитання . В двовимірному арифметичному просторі R^2 діє оператор симетрії відносно осі Ох. Його матриця в базисі e1 =(1,0), e2 =(0,1) є 
а) ( 1 0 0 -1 )   

80 Запитання . Множину власних значень оператора ортогонального проектування векторів на площину в геометричному тривимірному просторі складають числа 
а) 0 і 1 

81 Запитання . Завжди має власні вектори лінійний оператор у ненульовому просторі над полем 
а) комплексних чисел 

82 Запитання . Ядро лінійного оператора fi   складають вектори, які 
а) переводяться оператором fi   в нульовий вектор 

83 Запитання . Серед наведених далі лінійних просторів нескінченновимірним є 
а) простір многочленів з дійсними коефіцієнтами над полем дійсних чисел R 

84 Запитання . Нехай U, W – підпростори лінійного простору V, тоді підпростором не є 
а) V\U 

85 Запитання . Кількість підпросторів одновимірного лінійного простору дорівнює 
а) 2 

86 Запитання . Вимірність суми двох одновимірних підпросторів тривимірного простору може дорівнювати 
а) 2 

87 Запитання . Нехай fi - лінійний оператор у двовимірному просторі. Вимірність ядра оператора fi не може дорівнювати 
а) 3 

88 Запитання . Нехай дано різні точки M1(x1, y1) і M2(x2, y2). Тоді рівняння | x y 1, x1 y1 1, x2 y2 1 | =0 задає: 
а) пряму, що проходить через M1 і M2   

89 Запитання . Нехай дано різні точки A1 (x1, y1), A2 (x2, y2), тоді рівняння { x - x 1 = lambda(x2 - x1); y - y1 = lambda(y2 - y1)  , де параметр lambda є R, задає 
а) пряму A1A2   

90 Запитання . Яка функція невластива інформаційним системам?
а) збереження архіву документів у паперовому виді 

91 Запитання . Що є головними компонентами системи баз даних?
а) дані, апаратне забезпечення, програмне забезпечення, користувачі

92 Запитання . Що називається даними?
а) опис послідовності різних взаємозалежних явищ реального світу

93 Запитання . Однористувальницька система - це система у якій...
а) одночасно до бази даних може одержати доступ не більш одного користувача

94 Запитання . Багатокористувальницька система - це система, у якій..
а) одночасно до бази даних можуть одержати доступ відразу кілька користувачів

95 Запитання . Як називається найменша (тобто неподільна) одиниця пойменованих даних?
Запитання . Як називається найменша (тобто неподільна) одиниця пойменованих даних?

а) поле

96 Запитання . Що не відноситься до апаратного забезпечення системи баз даних?
а) система управління базою даних

97 Запитання . Чим займаються адміністратори баз даних?
а) Технічнім обслуговуванням системи баз даних

98 Запитання . Як називається програмне забезпечення у якого внутрішня структура залежить від структури збереження даних?
а) залежне від даних

99 Запитання . Що мыстить у собы архытектура ANSI/SPARC?
а) три рівні представлення даних: внутрішній, концептуальний і зовнішній

100 Запитання . Що таке зовнішній рівень в архітектурі ANSI/SPARC?
а) індивідуальне представлення користувачів 

101 Запитання . Що таке концептуальний рівень в архітектурі ANSI/SPARC?
а) представлення всієї інформації бази даних у більш абстрактній формі в порівнянні с фізичним способом збереження даних

102 Запитання . Що таке внутрішній рівень в архітектурі ANSI/SPARC?
а) представлення інформації в памяті (на фізичних пристроях збереження даних)

103 Запитання . Що передбачає архітектура клієнт-сервер?
а) передачу запита клієнтом, його обробку сервером і передачу клієнтові результату запиту

104 Запитання . Яке висловлення вірне?
а) реляційна база даних представлена у виді сукупності таблиць. Таблиці в реляційної системі є логічними, а не фізичними структурами

105 Запитання . Як представляється весь інформаційний зміст реляційної бази даних?
а) явним завданням значень даних

106 Запитання . Як називається загальна сукупність значень, з якої беруться значення для визначення атрибутів відношення?
а) домен

107 Запитання . Що називається кардинальним числом відношення R?
а) кількіть кортежів у відношенні

108 Запитання . Що називається ступенем відношення R? 
а) кількість атрибутів у відношенні

109 Запитання . Яка властивість відношення зазначена невірно?
а) атрибути упорядковані ліворуч праворуч

110 Запитання . Що називається похідним відношенням?
а) відношення, визначне (за допомогою реляційного вираження) через інші іменовані відношення і, у кінцевому рахунку. через базові відношення

111 Запитання . Що не відноситься до правил цілісності в базі даних?
а) обмеження на доступ до інформації дл користувачів

112 Запитання . Потенційним ключем К для відношення R назвемо підмножину атрибутів R, що володіє властивостями унікальності (немає двох різних кортежів у відношенні R з однаковим значенням К) і ненадмірності (ніяке з підмножин К не має властивість унікальності)
а) визначення вірне

113 Запитання . Коли потенційний ключ називається простим?
а) якщо складається з одного атрибута

114 Запитання . Зовнішнім ключем FK у базовому відношенні R2 називається підмножина атрибутів R2, для якого виконується дві властивості: існує базове відношення R1 (R1 і R2 не обовьязково різні) з потенційним ключем СК і кожне значення FK у поточному значенні R2 завжди збігається зі значенням СК деякого кортежу в поточному значенні R1.
а) визначення вірне

115 Запитання . Що визначає правило посилальної цілісності?
а) вимогу, що база даних не повинна містити неузгоджених значень зовнішніх ключів з відповідними їм первинними

116 Запитання . Два відношення сумісн по типу. якщо в них ідентичні заголовки, тобто виконані наступні дві вимоги: кожне з відносин мають однакову уількість атрибутів, а відповідно атрибути визначені на однакових доменах
а) визначення невірне

117 Запитання . Якої операції не має в реляційної алгебрі
а) зведення в ступінь

118 Запитання . Що називають схемою бази даних?
а) отримане в результаті проектування множина відношень, кожне з яких містить визначений набір атрибутів

119 Запитання . Яке визначення вірне?
а) процедура нормалізації включає розбивку даного відношення на інші відношення, причому декомпозиція повинна бути оборотною, тобто виконуватися без втрат інформації

120 Запитання . Яке визначення вірне?
а) відношення знаходиться в першій нормальній формі тоді і тільки тоді, коли усі використувані домени містять тільки скалярні значення

121 Запитання . Яке визначення вірне?
а) відношення знаходиться у другій нормальній формі тоді і тільки тоді, коли воно знаходиться в першій нормальній формі і кожен неключовий атрибут неприводимо залежить від первинного ключа 

122 Запитання . Як називається нормалізація з декомпозицією на незалежні проекції?
а) декомпозицією за збереженням залежностей

123 Запитання . У системах баз данних ..
а) дані і їхня інтерпритація розділені

124 Запитання . Чи є прикладні програмісти, які відповідають за написання програмного забезпечення, що використовує базу даних, користувачами системи бази даних?
а) так

125 Запитання . Яке висловлення невірне?
а) атрибути мають унікальні імена в базі даних

126 Запитання . Яке висловлення вірне?
а) один з потенційних ключів називається первинний ключ

127 Запитання . Для якої операції в реляційної алгебрі не потрібно сумісність по типу відношень?
а) поєднання

128 Запитання . Транзакція - це...
а) множина оперцій над інформацією в БД, що має властивості атомарності, погодженості, ізольованості ті тривалості (АПІТ)

129 Запитання . Властивість тривалості транзакції передбачає
а) закріплення результатів виконання успішно завершеної транзакції в БД навіть у випадку збою роботи системи

130 Запитання . Якщо одна з операцій транзакції порушує посилальну цілісність у БД, то 
а) транзакція буде автоматично перервана

в) результат перевірки БД на погодженість відкладається на етап підтвердження транзакції. Якщо БД буде перебувати в неузгодженому стані, то транзакція буде перервана (відкатана)

131 Запитання . Властивість ізольованості транзакції передбачає:
а) відсутність впливу одна на другу транзакцій, що виконується паралельно

132 Запитання . Властивість атомарності транзакції передбачає:
а) виконання всієї множини операцій, що містить транзакція, або невиконання жодної операції із цієї транзакції

133 Запитання . Команда MOV AX, CX 
а) уміст регістра СХ завантажить у регістр АХ 

134 Запитання . Команда XCHG AX, CX 
а) поміняє вміст регістрів місцями 

135 Запитання . У команді SAR [BX], використовується 
а) непряма реєстрова адресація 

136 Запитання . У 16-розрядному МП команди умовних переходів здійснюють: 
а) короткі переходи 

137 Запитання . У 16-розрядному МП максимальна довжина команди дорівнює: 
а) 6 байта 

138 Запитання . В асемблер-програмі 0АА77Н – це: 
а) константа DATA16 

139 Запитання . В асемблер-програмі LOOPE, LOOPNE – це: 
а) мнемоніки машинних команд 

140 Запитання . В асемблер-програмі 0ААН – це: 
а) константа DATA8 

141 Запитання . В асемблер-програмі директива DW визначає: 
а) слово 

142 Запитання . Швидкодія МП (операцій/сек) визначається часом виконання команд 
а) типу пересилання даного «регістр-регістр» 

143 Запитання . В асемблер-програмі директива DB визначає 
а) байт 

144 Запитання . В асемблер-програмі директива DD визначає 
а) подвійне слово 

145 Запитання . Команда ADD є 
а) арифметичною 

146 Запитання . У МП-системах стік організується 
а) програмістом 

147 Запитання . Стекова область пам'яті необхідна обов'язково при виконанні команд 
а) звертання до підпрограм 

148 Запитання . Покажчик стека є спеціалізованим регістром, що містить 
а) адресу оперативної пам'яті 

149 Запитання . Обмін даними між мікропроцесором і стеком здійснюється 
а) словами 

150 Запитання . Регістр прапорів (біт умов) у мікропроцесорах – це: 
а) сукупність ізольованих двоїчних розрядів 

151 Запитання . Біт арифметичного переповнення встановлюється при виконанні команд зрушень 
а) логічного (арифметичного) уліво 

152 Запитання . Біт арифметичного переповнення необхідний для виконання 
а) операцій «скласти (відняти)» над цілими зі знаком 

153 Запитання . Команди логічних операцій «І», «АБО», « виключаюче АБО» 
а) скидають біт переносу і допоміжного переносу 

154 Запитання . Структура регістрів загального призначення 16-розрядного МП дозволяє сказати, що можливо операції 
а) над словами і байтами 

155 Запитання . Адресний простір 16-розрядного МП може бути розбите на сегменти з максимальною довжиною 
а) 64 кілобайт 

156 Запитання . Запис даних у стек здійснюється командами 
а) типу PUSH 

157 Запитання . У регістрі біт умов усіх МП біт знака встановлюється 
а) співпадаючим зі старшим розрядом результату 

158 Запитання . У МП-системах обсяг оперативного запам'ятовуючого пристрою 
а) не більше обсягу адресного простору 

159 Запитання . Розрядність МП визначається 
а) розрядністю шини даних 

160 Запитання . Стік є спеціалізованою областю оперативної пам'яті з 
а) з послідовним доступом 

161 Запитання . У сімействі мікросхем фірми Intel базовим є 
а) 16-розрядний мікропроцесор 

162 Запитання . 8 і 16-розрядні мікропроцесори 
а) сумісні «знизу» 

163 Запитання . У базовому 16-розрядному МП обсяг адресного простору дорівнює 
а) 1 мегабайт 

164 Запитання . У МП-системах інтерфейсом називається: 
а) сукупність програмних і апаратних засобів 

165 Запитання . Програмно-керований обмін даними здійснюється 
а) мікропроцесором 

166 Запитання . У МП-системах двоспрямованою є 
а) шина даних 

167 Запитання . У МП- системах односпрямованою є 
а) шина керування 

168 Запитання . У МП-системах оперативне запам'ятовуюче пристрій (ОЗП) - це 
а) область зовнішньої пам'яті з довільною вибіркою, доступна командам МП 

169 Запитання . Регістр прапорів тісно зв'язаний 
а) з арифметико-логічним пристроєм АЛП 

170 Запитання . При сприйнятті сигналу переривання від зовнішнього пристрою мікропроцесор 
а) апаратно викликає підпрограму 

171 Запитання . Регістр МП, що утримує адреса наступної команди, що витягається з програмної пам'яті, називається 
а) лічильником команд 

172 Запитання . Взаємодія МП із зовнішніми пристроями системи організується 
а) блоком схеми керування 

173 Запитання . За допомогою 16 ліній адресної шини можна одержати доступ 
а) до 65 536 осередків оперативної пам'яті 

174 Запитання . Як основні символи мови С++ не можуть бути використані 
а) геометричні фігури 

175 Запитання . Що з перерахованого нижче може бути ідентифікатором? 
а) одна латинська буква 

176 Запитання . Ідентифікатор є сукупність 
а) від 1 до 32 латинських букв, арабських цифр і знаку підкреслення, що не починається з цифри 

177 Запитання . Яка з перерахованих послідовностей не може бути ідентифікатором 
а) 1 

178 Запитання . З приведених нижче перемінних базових типів найбільшу довжину має перемінна типу 
а) double 

179 Запитання . З приведених нижче перемінних базових типів найбільшу довжину має перемінна типу 
а) long double 

180 Запитання . З приведених нижче перемінних базових типів найменшу довжину має перемінні типу 
а) char 

181 Запитання . З приведених нижче перемінних базових типів найменшу довжину має перемінні типу 
а) short 

182 Запитання . Яка з констант 'м', 'a', 'к', 'п', більше? 
а) 'п' 

183 Запитання . Виберіть константу найменшу по довжині: 
а) 134.5f 

184 Запитання . Яка з констант не є константою з плаваючою точкою? 
а) 1 

185 Запитання . Константа з плаваючою точкою, займає 10 байт, якщо вона… 
а) задана з суфіксом L 

186 Запитання . Ціла константа задається… 
а) послідовністю цифр без наявності інших знаків, крім попередніх + і - 

187 Запитання . Виберіть константу максимальної довжини. 
а) 1.1 

188 Запитання . Локальна перемінна описується… 
а) у блоці 

189 Запитання . Локальна величина не може мати клас пам'яті… 
а) extern 

190 Запитання . Перемінна цілого типу може займати максимальну пам'ять, рівну… 
а) 8 байтам 

191 Запитання . Максимальна довжина перемінної з точкою, що плаває, дорівнює… 
а) 10 байт 

192 Запитання . У блоці дані описи. Який опис містить помилку? 
а) int x*,y 

193 Запитання . Нехай m – локальна змінна. Яке з приведених нижче описів зовнішніх змінних містить помилку? 
а) int t= m+1 

194 Запитання .Нехай дані описи зовнішніх величин: int n=3; int x=sin(2m)+4; const int p=32; int r=3.94, де m – локальна змінна. Який з описів невірний? 
а) int x=sin(2m)+4 

195 Запитання . Якій з описуваних об’єктів double x[2], y[3][2], z, *p; можна привласнити значення 1? 
а) z 

196 Запитання . Опис якого масиву містить помилку? int*a={2,3,4}, b[ ]={1,7,0}, c[4]={1,2,3}, d[3]={1,2,3,4} 
а) d 

197 Запитання . Коли масив не може ініціалізуватися за замовчуванням? 
а) коли він автоматичний 

198 Запитання . Чому дорівнює значення виразу х=3, ++х+1? 
а) 5 

199 Запитання . Чому дорівнює значення виразу х=2, х+++1? 
а) 3 

200 Запитання . Чому дорівнює значення y, якщо у=2, у=++у+3? 
а) 6 

201 Запитання . Результатом логічної операції && є… 
а) значення «істина» чи «хибність» 

202 Запитання . Результат логічної операції && є істина, якщо… 
а) обидва операнда істині 

203 Запитання . Результат логічної операції || є хибність, якщо… 
а) обидва операнда хибні 

204 Запитання . Потрібно скласти умову що р=2 і q=2. Яке з виражень вірно? 
а) p= =2 &&q= = 2 

205 Запитання . Як інтервал с < x < d записати на С++? 
а) c < x && x < d 

206 Запитання . Нехай точка М (х,у) належить до першої чверті. Як записати цю умову? 
а) x>0 &&y>0 

207 Запитання . Чому дорівнює значення y, якщо int a; double y; y=a=2.99, y++? 
а) 3.0 

208 Запитання .Чому дорівнює значення у, якщо int x =4, y=10; y= ((x>3 && ++x<7)? y+y: y-2)? 
а) 20 

209 Запитання . Записати умову, того, що, якщо х, у >0, то z приймає значення х, інакше 1… 
а) z= (x>0 && y>0)? x:1 

210 Запитання . Нехай int x. Який з виразів приймає значення 3? 
а) 2,3 

211 Запитання . Чому дорівнює значення х, якщо int х = (2,3) ?   (7,8)? 
а) 24 

212 Запитання . Якого типу повинне бути значення індексного виразу? 
а) цілого 

213 Запитання . Якщо n-ціле, то цілу частину відносини 100:n можна записати так… 
а) 100/n 

214 Запитання . Записати на С++ вираз a 3/4  : 
а) pow (a, 3. /4) 

г) power (3./4, а) 

215 Запитання . Записати на С++ вираз a 6 5  : 
а) pow (a, 6.0/5) 

г) power (6./5, а) 

216 Запитання . Чому дорівнює значення виразу (х - ціле) х=3,4, int (2 ?   x+1.7)? 
а) 7 

217 Запитання . Чому дорівнює значення виразу (х – ціле) х=3.9, z=x*x, x=x+x? 
а) 6 

218 Запитання . Нехай маємо int x, y; double z=2.5. Чому дорівнює значення виразу (x=z*z, y=x+int(z)) ? 
а) 8 

219 Запитання . Яка з бінарних операцій, що приводяться нижче, найпріоритетніша? 
а) * 

220 Запитання . Яка з бінарних операцій, що приводяться нижче, найпріоритетніша? 
а) % 

221 Запитання . Яка з бінарних операцій, що приводяться нижче, найпріоритетніша? 
а) && 

в) , (кома) 

222 Запитання . Яка з бінарних операцій, що приводяться нижче, найпріоритетніша? 
а) + 

223 Запитання . Яка з унарних операцій, що приводяться нижче, найпріоритетніша? 
а) - 

224 Запитання . Записати вираз, що привласнює z значення 1, якщо x, y належать внутрішності кола радіусу 1 з центром у точці (1;0) і 0 в протилежному випадку. 
а) if ((x-1)*(x-1)+y*y<1) z=1; else z=0 

225 Запитання . Чому дорівнює y, якщо int x=2, y=++x+3; if (y+2<=5) y=7,8? 
а) 6 

226 Запитання . Чому дорівнює а, якщо а = 10; if (a>1 &&20)a=2; else a=7? 
а)2 

227 Запитання . Чому дорівнює значення у після виконання фрагмента а=10; у=5; switch (a+a-3){case 23: y=y+1; break; case 13: case 15: case 17: y=y-1; break; default: y=1;} 
а) 4 

228 Запитання . Чому дорівнює значення y, якщо y=0.01; if(y) y=2; else if (x>1) y=3? 
а) 2 

229 Запитання .Чому дорівнює значення y, якщо int y=0; if(y) y=2; else if (++y>0) y=7? 
а) 7 

230 Запитання . Чому дорівнює значення y, якщо int y=0; if(++y>2) y=2; else if (++y>3) y=3; else y=4? 
а) 4 

231 Запитання . Чому дорівнює значення y, якщо int y; y=0; if(++y<4) if (++y==2) y=y; else y=7; 
а) 2 

232 Запитання . Який з приведених нижче операторів правильно формує символ Кронекера ? k 4  ? 
а) if (k==4) dk=1; else dk=0 

233 Запитання . При якому x значення y дорівнює 4, якщо switch(x-1){ case 7: m=1, y=m+3; break;case 4: case 6: y=x+х*x default: y=12;} 
а) 8 

234 Запитання . Для оператора for (e1;e2;e3) цикл нескінчений, якщо відсутні… 
а) e2 

235 Запитання . Нехай х=1, y=0.5. Яким з операторів заданий нескінченний цикл? 
а) while (1) x=y 

236 Запитання . Нехай маємо for (e1; e2; e3) s. Перемінним циклу можна привласнити початкові значення в… 
а) е1 

237 Запитання . В операторі for (e1; e2; e3) s; можна опускати точку з комою… 
а) ніде 

238 Запитання . Як ініціалізуються перемінні циклу, якщо в for (e1;e2;e3) s; відсутнє е1? 
а) перед for 

239 Запитання . Як здійснювати вихід з for (e1;e2;e3) s; , якщо відсутнє е2? 
а) за допомогою s 

240 Запитання . Замовлення пам'яті для масиву з 10 елементів цілого типу у вільному полі пам'яті здійснюється так: 
а) int ?   x=new int [10] 

241 Запитання . Оператором x=new int; замовлено пам'ять під… 
а) перемінну 

242 Запитання . Якщо зовнішній масив х має n 2   елементів типу int, то пам'ять для нього у вільному полі можна виділити оператором x=new int [n*n], що розташовується… 
а) у будь-якій функції 

243 Запитання . Якщо локальний масив потрібно розташувати у вільному полі пам'яті, то це можна зробити… 
а) усередині функції 

244 Запитання . Масив, розташований у вільному полі пам'яті, може бути… 
а) будь-яким 

245 Запитання . Стандартний потік введення має ім'я… 
а) cin 

246 Запитання . Стандартний потік виводу має ім'я… 
а) cout 

247 Запитання . Яке з імен може служити ім'ям потоку введення? 
а) lena 

248 Запитання . Ім'я потоку виводу можна призначити… 
а) за допомогою конструктора оfstream 

249 Запитання . Командою процесу define можна давати ім'я… 
а) будь-яким текстам 

250 Запитання . Суму всіх натуральних чисел до n обчислює програма… 
а) for (k=1, s=0; k<=n; s=s+k++) 

251 Запитання . Чому дорівнює значення s після виконання оператора for (k=0, s=0; k<100; s=s+1, k++)? 
а) 100 

252 Запитання . Елементами масиву int х[100], крім x 20   і x 30   є число 1. Чому дорівнює значення s, якщо for (k=0, s=0; x[k]==1; s++, k++)? 
а) 20 разів 

253 Запитання . Командою підключення файлів є… 
а) include 

254 Запитання . Нехай маємо: #define N 5 #define M N+3  int x = 2 ?  N+M-5 Тоді значення х дорівнює… 
а) 13 

255 Запитання . Нехай  #define N 5 #define M N*N double x[M][N] Скільки елементів має масив х? 
а) 125 

256 Запитання . Для відкриття файлу використовується функція… 
а) open 

257 Запитання . Функція може мати… 
а) будь-яке кінцеве число формальних параметрів 

258 Запитання . Інформація в функцію може передаватися… 
а) як через формальні параметри, так і через зовнішні величини 

259 Запитання . Перед ім'ям нетипізованих функцій ставиться ключове слово… 
а) void 

260 Запитання . Якщо прототипів функцій немає, то функція main у файлі може приводитися тільки… 
а) останньою 

261 Запитання . Якщо на початку файлу приведені прототипи всіх його функцій, то функція main може приводитися… 
а) у будь-якому місці 

262 Запитання . Дані можуть передаватися у функцію через… 
а) і через формальні параметри, і через зовнішні імена 

263 Запитання . Параметри за замовчуванню приводяться… 
а) після усіх формальних параметрів 

264 Запитання . Люба функція без прототипу видна… 
а) у файлі після свого опису 

265 Запитання . Що може бути фактичним параметром, якщо формальним є перемінна? 
а) будь-який неадресний вираз 

266 Запитання . Що з перерахованого нижче не може бути формальним параметром функції? 
а) елемент масиву 

267 Запитання . Що з перерахованого нижче не може бути формальним параметром функції? 
а) вираз 

268 Запитання . Якщо формальними параметрами є базова перемінна, то фактичний параметр може бути… 
а) вираз 

269 Запитання . Якщо фактичним параметром є ім'я масиву, то формальним може бути… 
а) ім'я покажчика або масиву 

270 Запитання . Якщо формальним параметром є посилання, то фактичним параметром може бути… 
а)ім'я перемінної 

271 Запитання . Формальні і фактичні параметри по типу… 
а) повинні бути сумісні 

272 Запитання . Якщо функція типізована, то вихід з неї здійснюється… 
а) оператором return e 

273 Запитання . Що з перерахованого нижче не може бути формальним параметром? 
а) строкова константа 

274 Запитання . Типізовані функції можуть мати оператори… 
а) return е1 

275 Запитання . У двох різних функцій не можуть співпадати… 
а) і імена і типи формальних параметрів 

276 Запитання . Скільки параметрів за замовчуванням може мати функція? 
а) будь-якої кількості 

277 Запитання . Два різних класи не можуть мати… 
а) однакові імена 

278 Запитання . Усі конструктори класу… 
а) мати різне число формальних параметрів 

279 Запитання . Об'єкти можуть бути… 
а) класового типу 

280 Запитання . Поза класом до членів з відкритої секції є доступ… 
а) за допомогою об'єктів 

281 Запитання . Поза класом даним із закритої секції класу є доступ… 
а) у дружніх функціях 

282 Запитання . Відкриті секції класу мають мітки… 
а) public 

283 Запитання . Закриті секції класу мають мітки… 
а) private 

284 Запитання . Члени з закритої секції класу доступні… 
а) дружнім функціям даного класу 

285 Запитання . Дружні функції класу визначаються… 
а) усередині даного класу 

286 Запитання . Початкові значення даним-членам класу привласнюються… 
а) конструктором 

287 Запитання . Звільнення пам'яті в класах здійснюється… 
а) деструктором 

288 Запитання . Підключення програм стандартних функцій з заголовних файлів виконує… 
а) компановщик 

289 Запитання . Після перезавантаження знака операції… 
а) пригодні і старе, і нове назначення

290 Запитання . Яке з настуних тверджень є вірним для довільних множин А, В
а) А=А пересечение (А обьединение В)

291 Запитання . Яке з настуних тверджень є вірним для довільних множин А, В
а) А входит А пересечение (А обьединение В)

292 Запитання . Яке з наступних тверджень  законом дистрибутивності?
а) (А обьединение В)пересечение С = (А пересечение С) обьединение (В пересечение С) 

293 Запитання . Яке з наступних тверджень є законом асоціативності?
а) А = А пересечение (А обьединение В)

294 Запитання . Яке з наступних тверджень є законом поглинання?
а) А = А пересечение (А обьединение В)

295 Запитання . Яке з наступних тверджень є правилом де Моргана?
а) не(А обьединение В)= не А пересечение не В

296 Запитання . Нехай А, В довільні скінчені множини, при якій умові |A обьединение B|=|A|+|B|
а) А пересечение В = пустое

297 Запитання . Яке з тверджень є невірним для довільних множин А, В?
а) |A обьединение B|=|A|+|B|

298 Запитання . А пересечение с не А дорівнює
а) пустое

299 Запитання . А/не А дорівнює
а) А

300 Запитання . А + не А дорівнює 
а) U

301 Запитання . не А/А дорівнює
а) не А

302 Запитання . Нехай А = {а є N: a кратні 2, В={b є N: b кратні 3}, яке з настуаних чисел не належить до A обьединение B
а) 5

303 Запитання . Нехай А = {а є N: a кратні 2, В={b є N: b кратні 3}, яке з настуаних чисел не належить до A пересечение B
а) 6

304 Запитання . Нехай А, В, С довільни множини, (x,y)є A x (B+C), яке з наступних тверджень є невірним?
а) y є В пересечение С

305 Запитання . Нехай А, В, С довільни множини, яке з наступних тверджень є невірним?
а) А/(В/С)=А/(В обьединение С)

306 Запитання . Х= {1,2,3}, p={(1,1), (1,2), (1,3)} відношення р буде
а) транзитивним

307 Запитання . Х= {1,2,3}, p={(1,1), (2,2), (3,3), (3,1)} відношення р буде
а) рефлексивним

308 Запитання . Х= {1,2,3}, p={(1,1), (1,2), (2,1)} відношення р буде
а) симетричним

309 Запитання . Х= {1,2,3}, p={(1,2), (3,2), (2,2)} відношення р буде
а) функціональним

310 Запитання . Х= {1,2,3}, p={(3,1), (1,2), (1,3)} відношення р буде
а) антирефлексивним

311 Запитання . Х= {1,2,3}, p={(1,1), (1,2), (1,3)} відношення р буде
а) антисиметричним

312 Запитання .  Х= {1,2,3}, p={(1,1), (1,2), (2,2)}, g={(2,2), (2,3)} яка з вказаних пар не входить до р*g
а) (1,1)

313 Запитання . Х= {1,2,3}, p={(1,1), (1,2), (2,2)}, g={(2,2), (2,3)} яка з вказаних пар входить до р*g
а) (2,2)

314 Запитання . Х= {1,2,3},яке з відношень є еквівалентністю на Х?
а) p={(1,1), (2,2), (3,3)}

315 Запитання . Х= {1,2,3},яке з відношень є порядком на Х?
а) p={(1,1), (1,2), (2,2), (3,3)}

316 Запитання . Х= {1,2,3},яке з відношень є строгим порядком на Х?
а) p={(1,1), (2,3), (1,3)}

317 Запитання . Нехай р, g є симетричні на Х і р не=g, яке з відношень не буде симетричним на Х?
а) кожен з вказаних відношень буде симетричним на Х

318 Запитання . Нехай р, g є рефлексивні на Х, яке з відношень не буде рефлексивним на Х?
а) р/g

319 Запитання . Нехай р, g є функціональні на Х, яке з відношень може не бути функціональним на Х?
а) р обьединение g

320 Запитання . Нехай р, g є антирефлексивні на Х, яке з відношень не буде антирефлексивним на Х? 
а) кожне з вказаних відношень буде антирефлексивним на Х

321 Запитання . Х= {1,2,3}, р={(1,1), (1,2), (2,1), (2,2), (3,3)}
а) 2

322 Запитання . Яке з вказаних відношень на R не буде антирефлексивним?
а) =

323 Запитання . Яке з вказаних відношень на R не буде антисеметричним?
а) не =

324 Запитання . На вершину гори ведуть 5 доріг. Скількома способами турист може піднятися в гору і спуститися з гори, якщо підйом і спуск необовязково повинен проходити по різних дорогах?
а) 25

325 Запитання .  На вершину гори ведуть 5 доріг. Скількома способами турист може піднятися в гору і спуститися з гори, якщо підйом і спуск обовязково повинен проходити по різних дорогах?
а) 20

326 Запитання . Скількома способами можно розкласти 12 різних подарунків по 4 різним пакетам?
а) 4^12

327 Запитання . З карток із числами 1 2 3 ..10 вибирають пять без повторення, скількома способами це можно зробити 
а) C10^5

328 Запитання . З карток із числами 1 2 3 ..10 вибирають пять без повторення, скількома способами це можно зробити так, щоб серед обраних була картка з числом 1?
а) C9^4

329 Запитання . З карток із числами 1 2 3 ..10 вибирають пять без повторення, скількома способами це можно зробити так, щоб серед обраних була картка з числами 1 і 6?
а) C8^3

330 Запитання . Скільки тризначних чисел можна скласти з цифр 1 2 3 4 5?
а) 5^3

331 Запитання . Скільки тризначних чисел можна скласти з цифр 1 2 3 4 5, якщо кожну з цих цифр можна використовувати не більше одного разу?
а) A5^3

332 Запитання . Скількома способами можна розсадити 9 чоловік  трьох вагонах метро?
а) 3^9

333 Запитання . Скількома способами можна розсадити 9 чоловік  трьох вагонах метро, так щоб у кожному вагоні було по 3 чоловіки?
а) C9^3*C6^3

334 Запитання . Скількома способами можна розділити на дві рівні частини колоду з 52 карт?
а) C52^26

335 Запитання . Група з 6 хлопчиків і 6 дівчинок діляться на дві рівні частини. Скільки існує способів поділу?
а) C12^6

336 Запитання . Група з 6 хлопчиків і 6 дівчинок діляться на дві рівні частини. Скільки існує способів поділу, якщо в кожній підгрупі буде порівно хлопчиків і дівчинок?
а) (C6^3)^2

337 Запитання . Скількома способами з повної колоди карт (52 карти) можна витягти чотири карти так, щоб усі вони були карттинками, тобто валет, дама, король і туз?
а) C16^4

338 Запитання . З карток із числами 1 2 3 ..10 вибирають пять з поверненням. скількома способами це можно зробити так, щоб серед обраних були картка з числами 1 і 6?
а) C12^3

339 Запитання . Скільки існує шестицифрових телефонних номерів, у яких усі цифри різні (можливо номери, що очинаються з 0)
а) A10^6

340 Запитання . Скільки існує шестицифрових телефонних номерів, у яких усі цифри однакові
а) 10

341 Запитання . Скількома способами можна розсадити за круглим столом 5 чоловіків і 5 жінок так, щоб особи однієї статі на сиділи поруч?
а) 2(5!5!)

342 Запитання Скількома способами з групи в 25 чоловік можна вибрати трьох для участі у зборах?
а) C25^3

343 Запитання . Скількома способами з групи в 25 чоловік можна вибрати старосту, профорга, і спортивного організатора (суміщення різних доручень не допускається)
а) A25^3

344 Запитання . Скільки можна скласти різних чотирицифрових шифрів для банківського сейфа (можливий шифр 0000)
а) 10^4

345 Запитання . Скільки можна скласти різних чотирицифрових шифрів для банківського сейфа, якщо всі цифри шифру різні?
а) A10^4

346 Запитання . Скільки можна скласти різних чотирицифрових шифрів для банківського сейфа, якщо всі цифри шифру однакові?
а) 10

347 Запитання . На залізничній станції є 9 світлофорів. Скільки може бути подано різних сигналів, якщо кожний світофор має три стани: червоний, жовний, зелений
а) 3^9

348 Запитання . Скільки різних парних тризначних чисел можна утворити із цифр 1 2 3 4 5 6
а) 108

349 Запитання . Скільки різних парних тризначних чисел, що закінчуються на 3, можна утворити із цифр 1 2 3 4 5 6
а) 36

350 Запитання . Дано n точок, жодноі 3 із яких не лежать на одній прямій. Скільки прямих можна провести, використовуючи всі пари точок?
а) Cn^2

351 Запитання . Скількома способами із повної колоди карт (52 карти) можна витягнути 8 карт так, щоб серед них було чотири дами?
а) C48^4

352 Запитання . Скількома способами із повної колоди карт (52 карти) можна витягнути 5 карт однієї масті
а) C4^1 C13^5

353 Запитання . Серед наведених формул знайти рівносильну до p=>q
а) p| или q

354 Запитання . Серед наведених формул знайти рівносильну до p<=>q
а) p| <=> q| 

355 Запитання . Серед наведених формул знайти рівносильну до (p и q)|
а) p| или q|

356 Запитання . Серед наведених формул знайти рівносильну до (p или q)|
а) p| или q|

357 Запитання . Серед наведених формул знайти рівносильну до (p=>q)|
а) p и q|

358 Запитання . Серед наведених формул знайти рівносильну до p+q
а) p| + q|

359 Запитання . Серед наведених формул знайти рівносильну до (p+q)|
а) p<=>q

360 Запитання . Серед наведених формул знайти тоточну одиницю
а) (p или q)<=>(q или p)

361 Запитання . Серед наведених формул знайти тотожну одиницю
а) (p и q)<=>(q и p)

362 Запитання . Серед наведених формул знайти тоточній нуль
а) (p и q)<=>(q| или p|)

363 Запитання . Серед наведених формул знайти тавтологію
а) р или р|

364 Запитання . Серед наведених функцій знайти досконалу дизюктивну нормальну форму для функції f(p,q)=(p=>q)
а) p|*q| или p|q или pq

365 Запитання . Серед наведених функцій знайти досконалу дизюктивну нормальну форму для функції f(p,q)=(p<=>q)
а) pq или p|*q|

366 Запитання . Серед наведених функцій знайти досконалу коньюктивну нормальну форму для функції f(p,q)=(p=>q)
а) p| или q

367 Запитання . Серед наведених функцій знайти досконалу коньюктивну нормальну форму для функції f(p,q)=(p<=>q)
а) (p или q|) и (p| или q)

368 Запитання . Серед наведених функцій f(p,q) вказати самодвоїсту 
а) pq| или pq

369 Запитання . Серед наведених функцій f(p,q) вказати самодвоїсту 
а) p|

370 Запитання . Серед наведених функцій f(p,q) вказати лінійну 
а) p+q

371 Запитання . Серед наведених функцій знайти двоїсту до функції  f(p,q)=p и q
а) p или q

372 Запитання . Серед наведених функцій знайти двоїсту до функції  f(p,q)=p <=> q
а) (p<=>q)|

373 Запитання . Яка з наведених функцій монотонна?
а) p или q

374 Запитання . Яка з наведених функцій монотонна?
а) p и q

375 Запитання . Яка з наведених функцій монотонна?
а) (p=>q)=>p

376 Запитання . Скільки існує нерівносильних між собою самодвоїстих булевих функцій від двох змінних?
а) 4

377 Запитання . Побудуйте Поліном Жегалкіна для функції f(p,q)=p=>q
а) 1+p+pq

378 Запитання . Побудуйте Поліном Жегалкіна для функції f(p,q)=(0101)
а) q

379 Запитання . Побудуйте Поліном Жегалкіна для функції f(p,q)=(p=>q)=>p
а) p

380 Запитання . Cкількома способами можна розкласти 3 різних подарунка по 4 однаковим пакетам?
а) 4^3

381 Запитання . Визначити, яке з наведених рівнянь є звичайним диф. рівнянням третього порядку?
а) x^2(y^2y'''-y'^3)=2y^2y'-3xyy'^2

382 Запитання . Яке з наведених рівнянь є звичайним диф. рівнянням другого порядку?
а) xy''-y^2lnx=2y'

383 Запитання . Яке з наведених рівнянь є звичайним диф. рівнянням першого порядку?
а) (y+sqrt(x))dx-sinydy=0

384 Запитання . Яке з наведеених рівнянь є диференціальним рівнянням першого порядку з частинними похідними
а) dz/dx+2*dz/dy=x-y

385 Запитання . Скільки розвязків має диференціальне ревняння y'+2y=e^x
а) безліч розвязків

386 Запитання . Скількі має розвязків довільне диференціальне рівняння другого порядку
а) безліч розвязків

387 Запитання . Які з наведених умов разом з диференціальним рівнянням (1+x^2)y'+2y=x^2*ln_y утворюють задачу Коші?
а) у(1)=2

388 Запитання . Які з наведених умов разом з диференціальним рівнянням (1+x^2)y''+2y=x^2 утворюють задачу Коші? 
а) y(0)=0, y'(0)=1

389 Запитання . Визначити тип диференціального рівняння (x^2y-ylny)dx-(2xy+xarctg(y))dy=0
а) з відокремлюваними змінними

390 Запитання . Яке з наведених рівнянь є однородним диференціальнім рівнянням першого порядку?
а) (x-ycos(y/x))dx+xcos(y/x)dy=0

391 Запитання . Визначити тип диференціального рівняння y'-2x=x^2-2y
а) лінійне

392 Запитання . Яке з наведених рівнянь є лінійним диференціальним рівнянням?
а) yctgx=y'-sin^2x

393 Запитання . Яке з наведених рівнянь є рівнянням в повних диференціалах?
а) (sinx+y)dy-(x^2-ycosx)dx=0

394 Запитання . Яке з наведених рівнянь є рівнянням в повних диференціалах?
а) (y/x+tgx)dx+(lnx+sqrt(y))dy=0

395 Запитання . Визначити тип диференцівльного рівняння sinx+2y=2xy'?
а) лінійне

396 Запитання . Яка функція є розвязком диференціального рівняння y'+y=2x+1
а) y=2x-1

397 Запитання . Яка функція є розвязком диференціального рівняння xy'-2y=2x^4
а) y=x^4

398 Запитання . Яка функція є розвязком диференціального рівняння x^2y''=y'^2
а) y=x^2/2

399 Запитання . Яка функція є розвязком диференціального рівняння y''=2yy'
а) y=tgx

400 Запитання . Яка интегральна крива рівняння y'+2y=e^x*y^2 проходить крізь точку (3,0)
а) y=0

401 Запитання . Визначити порядок диференційного рівняння y^4(y'^2-2yy'')=4x^3y^3y'+1
а) другий

402 Запитання . Яке з наведенних рівнянь є лінійним неоднорідним рівнянням першого порядку?
а) y'sinx+3y=e^x

403 Запитання . Яке з наведенних рівнянь є диференцівльним рівнянням сімейства кіл x^2+y^2=R^2
а) yy'+x=0

404 Запитання . Для рівняння y'''+x^2y'-x^3y=e^x, які з умов є умовами Коші?
а) y(1)=0, y'(1)=1, y''(1)=2

405 Запитання . Для рівняння y''-xy'+y/x=sin x які з умов є крайовими умовами?
а) y(1)=0, y'(2)=1

406 Запитання . Яке з наведених диференціальних рівнянь є лінійним?
а) x^2y''-xy'+y=e^x/x

407 Запитання . Яке з наведених диференціальних рівнянь є лінійним?
а) 2y'''+3y'cosx+x^2y''=lnx

408 Запитання . Диференціальне рівняння y''-y=2sinx має частний розвязок?
а) y=-sinx

409 Запитання . Якою заміною рівняння Ейлера для функціі у(х) може бути зведено до лінійного рівняння зі сталими коєфіцієнтами
а) x=e^t

410 Запитання . Для лінійного однородного диференціального рівняння n-го порядку n- розвязків лінійно незалежать тоді і тільки тоді. коли...
а) W(x)не=0 при любом х

411 Запитання . Яке з наведених рівнянь є рівнянням Ейлера
а) x^2y''+xy'+y=e^x

412 Запитання . Функції y1=e^x, y2=e^-x,y3=1 є фср диференціального рівняння...
а) y'''-y'=0

413 Запитання . Функції y1=cosx, y2=sinx, y3=1 є фср диференціального рівняння...
а) y'''+y'=0

414 Запитання . Загальний розвязок диференціального рівняння y''-4y'=0 має вигляд
а) y=c1+c2*e^4*x

415 Запитання . Нехай А, В, С -три деякі випадкові події. Яка з наданих нижче подій дорівнює (А обєднання В)персечение С
а) (А пересечение С)обьеднение(В пересечение С)

416 Запитання . Яке з наведених нижче тверджень вірне, якщо Р(А пересечение В)=0 і Р(А)не=0, Р(В)не=0
а) події А і В несумісні

417 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В -дві деякі несумісні події Р(А)не=0, Р(В)не=0
а) Р(А обьединение В)=Р(А)+Р(В)

418 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В -дві деякі незалежні події Р(А)не=0, Р(В)не=0
а) Р(А обьединение В)=Р(А)+Р(В)-Р(А)*Р(В)

419 Запитання . Нехац події Н1 і Н2 такі, що Н1 пересечение Н2=пустое і Р(А)=Р(А/Н1)Р(Н1)+Р(А/Н2)Р(Н2), А-довільна подія. Яке з наведених нижче сполучень значень Р(Н1) і Р(Н2) вірне?
а) Р(Н1)=1/5 і Р(Н2)=4/5

420 Запитання . Дослід полягає в одночасному підкиданні двох монет. Які з подій А=(випало дві решки), В=(випало два орли), С=(випали один орел і одна решка) рівноможливі?
Запитання . Дослід полягає в одночасному підкиданні двох монет. Які з подій А=(випало дві решки), В=(випало два орли), С=(випали один орел і одна решка) рівноможливі?

а) А, В

421 Запитання . В шкатулці знаходяться три картки з номерами 1,2,3. навмання одночасно виймають дві. Імовірність того, що обидва числа виявляться непарними, дорівнює
а) 1/3

422 Запитання . У шкатулці містяться три картки з номерами 1,2,3. навмання виймають по одній без повернення всі три. Імовірність того, що картки зявляться в послідовності 1,2,3, дорівнює
а) 1/6

423 Запитання . У межах квадрата із стороною 2, у центрі якого намальований круг радіуса 1, навмання вибирають точку. Імовірніть того, що точка потрапить у круг, дорівнює...
а) пи/4

424 Запитання . Двічі подкидають ігральний кубик. Кількість елементарних наслідків такого випадкового експеременту дорівнює
а) 6^2

425 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В - дві даякі події, Р(А/В)=Р(А)-Р(В) і Р(В)не=0?
а) В входит в А

426 Запитання . для події А обьединение В протилежною є подія 
а) неА пересечение неВ

427 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В?
а) Р(А обьединение В)>=Р(А)

428 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В?
а) Р(А пересечение В)=<Р(А)

429 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В. якщо Р(А пересечение В)=Р(А)
а) В входит в А

430 Запитання . Яке з наведених тверджень вірне для будь-яких невипадкових а не=0, b не=0 та будь-якої випадкової величини пси?
а) D(a*пси+b)=a^2D*пси

431 Запитання . Якщо пси_1,..,пси_n - вибірка спостережень над випадковою величиною пси, то незсуненою оцінкою дисперсії пси, якщо вона існує, є:
а) 1/n-1*sum(пси_і-пси)^2

432 Запитання . Якщо пси_1,..,пси_n - вибірка випадкової величини пси, то незсуненою оцінкою математичного сподівання пси, якщо вона існує, є:
а) 1/n*sum(пси_і)

433 Запитання . Спортсмен робить 10 пострілів по мішені. Ймовірність влучити в "яблучко " при одному пострілі дорівнює 0,8. Кількість влучень описується росподілом
а) біноміальним

434 Запитання . Яке з наведених нижче сполучень значень n і p вірне, якщо біноміально розподілена з параметрами (n,p) випадкова величина має математичне сподівання 12 та дисперсію 4?
а) n=18, p=2/3

435 Запитання . Яке з наведених нижче тверджень вірне, якщо випадкова величина пси приймає значення х1,..,хn..із ймовірностями p1,..pn,..
а) sum(p_i)=1

436 Запитання . Закон розподілу випадкової величини пси має вигляд: 0 1 2 3 4 , 0.2 0.1 0.1 0.5 0.1. Яке з наведених нижче тверджень не вірне?
а) Р{пси>=2}=0.8

437 Запитання . Нехай пси число влучень у ціль при чотирьох пострілах з імовірністю влучення 1/2 в кожному. Який з наведених нижче законів розподілів має пси?
а) (1/2)^4

438 Запитання . Яке з наведених нижче тверджень вірне, якщо закон розподілу випадкової величини пси має вигляд -1 0 1, 0.2 0.3 0.5 ?
а) Р{пси=<0} = P{пси>0}

439 Запитання . Яке з наведених нижче тверджень не може бути вірним, якщо F(х) - функція розподілу випадкової величини пси?
а) F(x)>1, для деякого х

440 Запитання . Якщо F(х)- функція розподілу невідьємної випадкової величини, то для відємних значень аргументу...
а) F(х)=0

441 Запитання . Яке з наведених нижче тверджень вірне для будь-якої випадкової величини пси?
а) P{пси>=x1}>=P{пси>=x2}, для будь-яких x1<x2

442 Запитання . Функція розподілу рівномірної на [0;2] випадкові величини при всіх х>=2 доівнює
а) 1

443 Запитання . f(x) - щыльнысть розподілу деякої випадкової величини. Яка з наведених рівностей не може мати місця?
а) int(f(x), -infinity...+infinity)=1/2

444 Запитання . Яке з наведених нижче функцій є щільністю розподілу деякої випадкової величини?
а) f(x)={2x, .....}

445 Запитання . Яке з наведених нижче тверджень вірне, якщо функція розподілц випадкової величини пси неперервна?
а) P{пси=a}=P{пси=b}для будь-яких a<b

446 Запитання . Яке з наведених нижче тверджень вірне, якщо f(x) - щільність розподілу випадкової величини пси ?
а) P{a<пси=<b}=int(f(x), a..b) для будь-яких a=<b

447 Запитання . Вкажіть невірне твердження відносно двомірної функції розподілу F(x,y)
а) lim(x->+inf, y->-inf) F(x,y)не=0

448 Запитання . Вкажіть вірне твердження відносно двомірної функції розподілу F(x,y) випадкового вектора (пси, этта)
Запитання . Вкажіть вірне твердження відносно двомірної функції розподілу F(x,y) випадкового вектора (пси, этта)

а) lim F(x,y)=P{пси>=х}

449 Запитання . Яка з рівностей не має місця для довільних випадкових величин пси та этта?
а) Mпси(этта-1)=Mпси*Mэтта-Mпси

б) M(пси-этта)=Mпси-Mэтта

450 Запитання . Нехай пси та этта незалежні випадкові величини. Вкажіть вірне твердження.
а) М(пси-Мпси)(эта-Мэта)=0

в) М(пси-эта)(пси+эта)=(Мпси)^2-(Мэта)^2

г) Мпси(пси-эта)=Мпси(Мпси-Мэта)

451 Запитання . Нехай пси та этта незалежні випадкові величини. Вкажіть вірне твердження.
а) D(пси-єта)=Dпси+Dєта

в) D(пси-єта)=Dпси-Dєта

г) D(2пси+єта)=2Dпси+Dєта

452 Запитання . Нехай пси деяка випадкова величина. Вкажіть вірне твердження.
а) D(пси-1)=Dпси

453 Запитання . Нехай випадкова подія А та В такі, що Р(А)0, Р(В)0 та Р(А/В)=0. Вкажіть не вірне твердження.
а) А та В незалежні

454 Запитання . Які з наведених даних дозволяють обчислити Р(А) та Р(В)? 
а) 1/6, 5/6, 1/3

455 Запитання . Значення яких з наведених нижче величин дозволяють обчислити Р(В пересечение А) для довільних подій А і В (Р(А)*Р(В)не=0)
а) Р(В) та Р(А/В)

456 Запитання . Яка з наведених подій не співпадає з А
а) А обьединение неА пересечение неА

457 Запитання . Яка аз наведених подій відбувається завжди (А і В довільні події)
а) (А обьединение В) обьединение (неА пересечение неВ)

458 Запитання . Яка з наведених подій є протилежною до події А пересечение неВ (А і В довільні події)?
а) неА обьединение В

459 Запитання . На відрізку довжиною l навмання вибирають точку. Яке з наведених співвідношень має місця, якщо А = {точка потрапить лівіше середини відрізка}, В = {точка потрапить правіше середини відрізка} і С = {точка потрапить ближче до середини відрізка, ніж до його кінців}?
а) Р(А)=Р(В)=Р(С)

460 Запитання . З карток з номерами 1,2,3 навмання по черзі беруть дві і складають двозначне число. Ймовірність того, що отримане число буде парним, дорівнює
а) 1/3

461 Запитання . Випадкова величини пси має біноміальний розподіл з параметрами (10; 0.8). Яке з наведених тверджень є невірним?
а) Р(пси=2)=Р(пси=8)

462 Запитання . Закон розподілу випадкової величини пси має вигляд -1 0 1 , 1/4 1/3 р. Вкажіть вірне твердження  
а) Р(пси<0)<P(пси>0)

463 Запитання . Гральний кубик підкидають до першої появи шістки. Який розподіл має випадкова величини пси - загальна кількість підкидань?
а) Р(пси=к)=1/6*(5/6)^к

464 Запитання . Вкажіть вірне серед наведених нижче тверджень відносно функції розподілу F(x)
а) lim F(x)<lim F(x)

465 Запитання . Яка з рівностей не вірна, якщо F(x) - функція розподілу довільної випадкової величини пси?
а) P(a<пси<b)=F(b)-F(a)a<b

466 Запитання . Серед наведених нижче тверджень відносно функції розподілу F(x) довільної випадкової величини вкажіть невірне
а) F(x) - неперервна функція

467 Запитання . Яка з рівностей вірна, якщо F(x) - функція розподілу довільної випадкової величини пси?
а) P(пси=<a)=F(a+0)

468 Запитання . Серед наведених функцій вкажіть ту, яка може бути функцією розподілу деякої випадкової величини
а) F(x)=1-e^-3x

469 Запитання . Вкажіть вірне серед наведених тверджень відносно розподілу F(x) випадкової величини пси
а) P{a=<пси=<c}=<int(f(x)), a<c<b

470 Запитання . Випадкові величини пси, ета та кси мають рівномірний розподіл  відповідно на інтервалах [0,1][1,2][2,3]. Яке з наведених тверджень вірне: 
а) Mpci < Meta < Mkci

471 Запитання . Випадкові величини пси, ета та кси мають пуасонівський розподіл з парметрами 1,2,3 відповідно . Яке з наведених тверджень вірне:
а) Mpci < Meta < Mkci

472 Запитання . Ймовірність того, що подія А_і відбудеться у віпадковому експеременті, дорівнює р_і, і=1,2,3, р1=р2>р3.Проводиться N таких незалежних експерементів. Випадкові величини пси_і - кількості експерементів, в яких спостерігається подія А_і. Яке з наведених тверджень вірне?
а) Mpci1 = Mpci2 > Mpci3

473 Запитання . Випадкові величини пси, ета та кси мають нормальний розподіл  з параметрами (0,1)(0,2)(0,3). Яке з наведених тверджень вірне: 
а) Mpci = Meta = Mkci

474 Запитання . Випадкові величини пси, ета  мають експоненціальний розподіл з параметрами ламда і мю (ламда < мю). Яке з наведених тверджень вірне: 
а) Mpci > Meta

475 Запитання . Випадкові величини пси, ета та кси мають рівномірний розподіл  відповідно на інтервалах [0,1][1,2][2,3]. Яке з наведених тверджень вірне: 
а) Dpci = Deta = Dkci

476 Запитання . Випадкові величини пси, ета мають пуасонівський розподіл  з параметрами ламда і мю. Яке з наведених тверджень невірне: 
а) Meta < Mpci = Deta

477 Запитання . Випадкова величина пси має пуасонівський розподіл. Яке з наведених тверджень вірне?
а) Mpci = Dpci

478 Запитання . Випадкові величини пси, ета та кси мають цільності розподілу відповідно. Яке з наведених тверджень не вірне? (большая формула) 
Запитання . Випадкові величини пси, ета та кси мають цільності розподілу відповідно. Яке з наведених тверджень не вірне? (большая формула) 

а) Mэта<Мкси=Dкси

479 Запитання . Нехай А, В, С -три деякі випадкові події. Яка з наданих нижче подій дорівнює (А обєднання В)персечение С
а) (А пересечение С)обьеднение(В пересечение С)

480 Запитання . Яке з наведених нижче тверджень вірне, якщо Р(А пересечение В)=0 і Р(А)не=0, Р(В)не=0
а) події А і В несумісні

481 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В -дві деякі несумісні події Р(А)не=0, Р(В)не=0
а) Р(А обьединение В)=Р(А)+Р(В)

482 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В -дві деякі несумісні події Р(А)не=0, Р(В)не=0
а) Р(А обьединение В)=Р(А)+Р(В)-Р(А)*Р(В)

483 Запитання . Нехац події Н1 і Н2 такі, що Н1 пересечение Н2=пустое і Р(А)=Р(А/Н1)Р(Н1)+Р(А/Н2)Р(Н2), А-довільна подія. Яке з наведених нижче сполучень значень Р(Н1) і Р(Н2) вірне?
а) Р(Н1)=1/5 і Р(Н2)=4/5

484 Запитання . Дослід полягає в одночасному підкиданні двох монет. Які з подій А=(випало дві решки), В=(випало два орли), С=(випали один орел і одна решка) рівноможливі?
Запитання . Дослід полягає в одночасному підкиданні двох монет. Які з подій А=(випало дві решки), В=(випало два орли), С=(випали один орел і одна решка) рівноможливі?

а) А, В

485 Запитання . В шкатулці знаходяться три картки з номерами 1,2,3. навмання одночасно виймають дві. Імовірність того, що обидва числа виявляться непарними, дорівнює
а) 1/3

486 Запитання . У шкатулці містяться три картки з номерами 1,2,3. навмання виймають по одній без повернення всі три. Імовірність того, що картки зявляться в послідовності 1,2,3, дорівнює
а) 1/6

487 Запитання . У межах квадрата із стороною 2, у центрі якого намальований круг радіуса 1, навмання вибирають точку. Імовірніть того, що точка потрапить у круг, дорівнює...
а) пи/4

488 Запитання . Двічі подкидають ігральний кубик. Кількість елементарних наслідків такого випадкового експеременту дорівнює
а) 6^2

489 Запитання . Яке з наведених нижче тверджень вірне, якщо А і В - дві даякі події, Р(А/В)=Р(А)-Р(В) і Р(В)не=0?
а) В входит в А

490 Запитання . для події А обьединение В протилежною є подія 
а) неА пересечение неВ

491 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В?
а) Р(А обьединение В)>=Р(А)

492 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В?
а) Р(А пересечение В)=<Р(А)

493 Запитання . Яке з наведених нижче тверджень вірне для будь-яких подій А і В. якщо Р(А пересечение В)=Р(А)
а) В входит в А

494 Запитання . Яке з наведених тверджень вірне для будь-яких невипадкових а не=0, b не=0 та будь-якої випадкової величини пси?
а) D(a*пси+b)=a^2D*пси

495 Запитання . Якщо пси_1,..,пси_n - вибірка спостережень над випадковою величиною пси, то незсуненою оцінкою дисперсії пси, якщо вона існує, є:
а) 1/n-1*sum(пси_і-пси)^2

496 Запитання . Якщо пси_1,..,пси_n - вибірка випадкової величини пси, то незсуненою оцінкою математичного сподівання пси, якщо вона існує, є:
а) 1/n*sum(пси_і)

497 Запитання . Спортсмен робить 10 пострілів по мішені. Ймовірність влучити в "яблучко " при одному пострілі дорівнює 0,8. Кількість влучень описується росподілом
а) біноміальним

498 Запитання . Яке з наведених нижче сполучень значень n і p вірне, якщо біноміально розподілена з параметрами (n,p) випадкова величина має математичне сподівання 12 та дисперсію 4?
а) n=18, p=2/3

499 Запитання . Яке з наведених нижче тверджень вірне, якщо випадкова величина пси приймає значення х1,..,хn..із ймовірностями p1,..pn,..
а) sum(p_i)=1

500 Запитання . Закон розподілу випадкової величини пси має вигляд: 0 1 2 3 4 , 0.2 0.1 0.1 0.5 0.1. Яке з наведених нижче тверджень не вірне?
а) Р{пси>=2}=0.8

501 Запитання . Нехай пси число влучень у ціль при чотирьох пострілах з імовірністю влучення 1/2 в кожному. Який з наведених нижче законів розподілів має пси?
а) (1/2)^4

502 Запитання . Яке з наведених нижче тверджень вірне, якщо закон розподілу випадкової величини пси має вигляд -1 0 1, 0.2 0.3 0.5 ?
а) Р{пси=<0} = P{пси>0}

503 Запитання . Яке з наведених нижче тверджень не може бути вірним, якщо F(х) - функція розподілу випадкової величини пси?
а) F(x)>1, для деякого х

504 Запитання . Якщо F(х)- функція розподілу невідьємної випадкової величини, то для відємних значень аргументу...
а) F(х)=0

505 Запитання . Яке з наведених нижче тверджень вірне для будь-якої випадкової величини пси?
а) P{пси>=x1}>=P{пси>=x2}, для будь-яких x1<x2

506 Запитання . Функція розподілу рівномірної на [0;2] випадкові величини при всіх х>=2 доівнює
а) 1

507 Запитання . f(x) - щыльнысть розподілу деякої випадкової величини. Яка з наведених рівностей не може мати місця?
а) int(f(x), -infinity...+infinity)=1/2

508 Запитання . Яке з наведених нижче функцій є щільністю розподілу деякої випадкової величини?
а) f(x)={2x, .....}

509 Запитання . Яке з наведених нижче тверджень вірне, якщо функція розподілц випадкової величини пси неперервна?
а) P{пси=a}=P{пси=b}для будь-яких a<b

510 Запитання . Яке з наведених нижче тверджень вірне, якщо f(x) - щільність розподілу випадкової величини пси ?
а) P{a<пси=<b}=int(f(x), a..b) для будь-яких a=<b

511 Запитання . Вкажить невірне твердження відносно двомірної функції розподілу F(x,y)
а) lim F(x,y)не=0

512 Запитання . Вкажіть вірне твердження відносно двомірної функції розподілу F(x,y) випадкового вектора (пси, этта)
Запитання . Вкажіть вірне твердження відносно двомірної функції розподілу F(x,y) випадкового вектора (пси, этта)

а) lim F(x,y)=P{пси>=х}

513 Запитання . Яка з рівностей не має місця для довільних випадкових величин пси та этта?
а) Mпси(этта-1)=Mпси*Mэтта-Mпси

б) M(пси-этта)=Mпси-Mэтта

514 Запитання . Нехай пси та этта незалежні випадкові величини. Вкажіть вірне твердження.
а) М(пси-Мпси)(эта-Мэта)=0

в) М(пси-эта)(пси+эта)=(Мпси)^2-(Мэта)^2

г) Мпси(пси-эта)=Мпси(Мпси-Мэта)

515 Запитання . Нехай пси та этта незалежні випадкові величини. Вкажіть вірне твердження.
а) D(пси-єта)=Dпси+Dєта

в) D(пси-єта)=Dпси-Dєта

г) D(2пси+єта)=2Dпси+Dєта

516 Запитання . Нехай пси деяка випадкова величина. Вкажіть вірне твердження.
а) D(пси-1)=Dпси

517 Запитання . Нехай випадкова подія А та В такі, що Р(А)0, Р(В)0 та Р(А/В)=0. Вкажіть не вірне твердження.
а) А та В незалежні

518 Запитання . Які з наведених даних дозволяють обчислити Р(А) та Р(В)? 
а) 1/6, 5/6, 1/3

519 Запитання . Значення яких з наведених нижче величин дозволяють обчислити Р(В пересечение А) для довільних подій А і В (Р(А)*Р(В)не=0)
а) Р(В) та Р(А/В)

520 Запитання . Яка з наведених подій не співпадає з А
а) А обьединение неА пересечение неА

521 Запитання . Яка аз наведених подій відбувається завжди (А і В довільні події)
а) (А обьединение В) обьединение (неА пересечение неВ)

522 Запитання . Яка з наведених подій є протилежною до події А пересечение неВ (А і В довільні події)?
а) неА обьединение В

523 Запитання . На відрізку довжиною l навмання вибирають точку. Яке з наведених співвідношень має місця, якщо А = {точка потрапить лівіше середини відрізка}, В = {точка потрапить правіше середини відрізка} і С = {точка потрапить ближче до середини відрізка, ніж до його кінців}?
а) Р(А)=Р(В)=Р(С)

524 Запитання . З карток з номерами 1,2,3 навмання по черзі беруть дві і складають двозначне число. Ймовірність того, що отримане число буде парним, дорівнює
а) 1/3

525 Запитання . Випадкова величини пси має біноміальний розподіл з параметрами (10; 0.8). Яке з наведених тверджень є невірним?
а) Р(пси=2)=Р(пси=8)

526 Запитання . Закон розподілу випадкової величини пси має вигляд -1 0 1 , 1/4 1/3 р. Вкажіть вірне твердження  
а) Р(пси<0)<P(пси>0)

527 Запитання . Гральний кубик підкидають до першої появи шістки. Який розподіл має випадкова величини пси - загальна кількість підкидань?
а) Р(пси=к)=1/6*(5/6)^к-1

528 Запитання . Вкажіть вірне серед наведених нижче тверджень відносно функції розподілу F(x)
а) lim F(x)<lim F(x)

529 Запитання . Яка з рівностей не вірна, якщо F(x) - функція розподілу довільної випадкової величини пси?
а) P(a=<пси=<b)=F(b+0)-F(a)a<b

530 Запитання . Серед наведених нижче тверджень відносно функції розподілу F(x) довільної випадкової величини вкажіть невірне
а) F(x) - неперервна функція

531 Запитання . Яка з рівностей вірна, якщо F(x) - функція розподілу довільної випадкової величини пси?
а) P(пси=<a)=F(a+0)

532 Запитання . Серед наведених функцій вкажіть ту, яка може бути функцією розподілу деякої випадкової величини
а) F(x)=1-e^-3x

533 Запитання . Вкажіть вірне серед наведених тверджень відносно розподілу F(x) випадкової величини пси
а) P{a=<пси=<c}=<int(f(x)), a<c<b

534 Запитання . Випадкові величини пси, ета та кси мають рівномірний розподіл  відповідно на інтервалах [0,1][1,2][2,3]. Яке з наведених тверджень вірне: 
а) Mpci < Meta < Mkci

535 Запитання . Випадкові величини пси, ета та кси мають пуасонівський розподіл з парметрами 1,2,3 відповідно . Яке з наведених тверджень вірне:
а) Mpci < Meta < Mkci

536 Запитання . Ймовірність того, що подія А_і відбудеться у віпадковому експеременті, дорівнює р_і, і=1,2,3, р1=р2>р3.Проводиться N таких незалежних експерементів. Випадкові величини пси_і - кількості експерементів, в яких спостерігається подія А_і. Яке з наведених тверджень вірне?
а) Mpci1 = Mpci2 > Mpci3

537 Запитання . Випадкові величини пси, ета та кси мають нормальний розподіл  з параметрами (0,1)(0,2)(0,3). Яке з наведених тверджень вірне: 
а) Mpci = Meta = Mkci

538 Запитання . Випадкові величини пси, ета  мають експоненціальний розподіл з параметрами ламда і мю. Яке з наведених тверджень вірне: 
а) Mpci > Meta

539 Запитання . Випадкові величини пси, ета та кси мають рівномірний розподіл  відповідно на інтервалах [0,1][1,2][2,3]. Яке з наведених тверджень вірне: 
а) Dpci = Deta = Dkci

540 Запитання . Випадкові величини пси, ета мають пуасонівський розподіл  з параметрами ламда і мю. Яке з наведених тверджень невірне: 
а) Meta < Mpci = Deta

541 Запитання . Випадкова величина пси має пуасонівський розподіл. Яке з наведених тверджень вірне?
а) Mpci = Dpci

542 Запитання . Випадкові величини пси, ета та кси мають цільності розподілу відповідно. Яке з наведених тверджень не вірне? (большая формула) 
Запитання . Випадкові величини пси, ета та кси мають цільності розподілу відповідно. Яке з наведених тверджень не вірне? (большая формула) 

а) Mэта<Мкси=Dкси

543 Запитання . Якого ступеня можно побудувати інтерполяційний многочлен Лагранжа по всіх заданих значеннях функции f(Xij)(i=1,2,3,4),xi є [a,b]?
а) третьої

544 Запитання . Коли задача лінійнох інтерполяції функції f(x) x є [a,b], розвязувана за допомогою узагальненого многочлена fi=sum(a_k fi_k(x)) при заданих (n+1) значеннях f(x), може бути розвязана єдиним спомобом?
а) функції fi_0(x),...,fi_n(x) утворять систему Чебишева на відрізку [a,b]

545 Запитання . Чому дорівнює порядок похідної  від функції f(x) x є [a,b], що входить у залишковий член інтерполяційного многочлена Лагранжа третього ступеня?
а) чотирьом

546 Запитання . Якому класу функцій, визначних на відрізку [a,b], повинна належпти функція f(x), щоб її можно було б інтерполювати за допомогою інтерполяційного многочлена Лагранжа 4-го ступеня? 
а) f(x)єC^m[a,b],m>=5

547 Запитання . Як можна оцінити залишковий член R(x) інтерполяційного многочлена Лагранже n-го ступеня, що інтерполює функцією f(x) на відрізку [a,b]
а) |R|=<|f^(n+1)|w/(n+1)!

548 Запитання . Який із наступних інтерполяційних многочленів, побудованих за значеннями функції f(x) в пятьох вузлах x0<x1<..<x4 доцільно використовувати при обчисленні в точці x=x*, x0<x*<x1
а) Ньютона для інтерполяції вперед

549 Запитання . Який із наступних інтерполяційних многочленів, побудованих за значеннями функції в пятьох вузлах x0<x1<..<x4 доцільно використовувати при обчисленні в точці x=x*, x3<x*<x4
а) Ньютона для інтерполяції назад

550 Запитання . Який із побудованих за значеннями функції у вузлах xi=x0+ih, i=-2,-1,0,1,2 наступних інтерполяційних многочленів доцільно використовувати при обчисленні в точці x=x*, x0<x*<x1
а) Гауса

551 Запитання . До якої із наступних груп методів розвязування систем лінійних алгебраїчних рівнянь відноситься метод виключення Гауса з вибором звичайного провідного елемента?
а) до точних

552 Запитання . До якої із наступних груп методів розвязування систем лінійних алгебраїчних рівнянь відноситься метод виключення з вибором звичайного провідного елемента?
а) до точних

553 Запитання . До якої із наступних груп методів розвязування систем лінійних алгебраїчних рівнянь відноситься метод виключення Зейделя?
а) до ітераційних

554 Запитання . У якому випадку методом виключення можна одержати точне розвязування системи лінійних алгебраїчних рівнянь Ax=b, A={aij} i,j=1..n, b={bi}i=1..n ?
а) всі елементи aij і bi задані точно, а обчислення проводиться без округлень

555 Запитання . Яка умова необхідна і достатня для збіжності методу простої ітерації при розвязуванні системи лінійних алгебраїчниї рівнянь X=alfa*X+betta, alfa={alfa_ij} i,j=1,..n; betta_i={betta_i} i=1,..n, X0={Xi0} i=1,..n будьяке початкове наближення?
а) власні значення lambda_i^alfa матриці alfa задовільняють умові: |lambda_i^alfa|<1 (i=1,..n)

556 Запитання . Яка умова є достатньою умовою збіжності методу простої ітерації при розвязуванні системи лінійних алгебраїчниї рівнянь X=alfa*X+betta, alfa={alfa_ij} i,j=1,..n; betta_i={betta_i} i=1,..n ?
а) норма матриці alfa менше одиниці

557 Запитання . Як можна охаректеризувати збіжність послідовності наближень Хк={x_ik}i=1..n до розвязування системи лінійник алгебраїчних рівнянь X=alfa*X+betta, alfa={alfa_ij} i,j=1,..n; betta_i={betta_i} i=1,..n у методі простої ітерації у випадку ||alfa||<1?
а) послідовність Хк збігається зі швидкістю геометричної прогресії

558 Запитання . Коли похибка rk=X*-Xk наближеного розвязку xk системи лінійних алгебраїчних рівнянь X=alfa*X+betta, alfa={alfa_ij} i,j=1,..n; betta_i={betta_i} i=1,..n (Х*-точний розвязок системи), знайденого методом простої ітерації при ||alfa||<1 задовольняє нерівності ||rk||<eps
а) ||alfa||/(1-||alfa||)||Xk-X_k-1||<eps

559 Запитання . При яких значеннях постійної q що, входить в умову Sum(|a_ij|=<q|a_ii|)(i=1,2...n), метод Зейделя збігається до розвязку системи лінійних алгебаїчних рівнянь не повільніше методу простої ітерації?
а) q<1

560 Запитання . Який з наступних методів розвязування проблеми власних значень матриць заснований на теоремі Гамільтона-Келі?
а) Крилова

561 Запитання . Який з наступних методів розвязування проблеми власних значень матриць заснований на перетворені подібних матриць?
а) Данилевського 

562 Запитання . Який з наступних методів розвязування проблеми власних значень матриць призначений для розвязування часткової проблеми власних значень матриць?
а) ітераційний степеневий

563 Запитання . Які з наступних методів розвязування проблеми власних значень матриць вимагають попереднього визначення коефіцієнтів характеристичного рівняння?
а) Крилова і Данилевського

564 Запитання . Яке число може бути старшим коефіцієнтом мінімального многочлена матриці А?
а) одиниця

565 Запитання . Чому дорінює максимально можливе число лінійно назалежних векторів у послідовності векторів b0|, Ab0|, ..,A^mb0|,..(b0| - деякий відмінний від нульового вектор), побудованій при розвязуванні проблем власних значень матриці А порядку  методом Крилова?
а) n

566 Запитання . Чим замінюють підінтегральну функцію при побудові формул чисельного інтегрування?
а) інтерполяційним многочленом

567 Запитання . Яка з квадратурних формул лівих, середніх і правих прямокудників більш точна?
а) середніх прямокутників

568 Запитання . Чим є вузли у квадратурних формулах Ньютона-Котеса?
а) точками розбивки відрізка інтегрування на рівні частини

569 Запитання . Яке з приведених квадратурних формул є формулою трапеції
а) int(f(x)dx,a..b)= (b-a)/2[f(a)+f(b)]

570 Запитання . Чим геометрично замінюється підінтегральна функція на відрізку інтегрування в квадратурній формулі Сімпсона
а) куском параболи

571 Запитання . Як змінюється кількість вузлів на відрізку інтегрування ри побудові узагальнених кваддратурних формул прямокутників, трапецій, Сімпсона?
а) збільшується

572 Запитання . Як звьязані між собою точне значеня інтеграла int((x^3)dx,1..2) і наближене, обчислене по формулі Сімпсона?
а) рівні між собою

573 Запитання . Для многочленів якого ступеня квадартурна формула Чебишева є точною?
а) n

574 Запитання . Що можна сказати про коефіцієнти квадратурної формули Чебишева?
а) рівні між собою

575 Запитання . Як визначаються вузли квадартурної формули Гауса
а) є коренями многочлена Лежандра

576 Запитання . Яку заміну змінних потрібно зробити при обчисленні інтеграла по формулі Чебишева і Гауса на довільному відрізку [a,b] 
а) x=(a+b)/2+(b-a)*t/2

577 Запитання . Яка з квадратурних формул, що побудова по 6 вузлах, більш точна?
а) Гауса

578 Запитання . Для многочленів якого ступеня квадратурна формула Гауса є точною?
а) 2n-1

579 Запитання . Яка умова існування єдиного кореня рівняння f(x)=0 на відрізку [a,b]?
а) f(a)f(b)<0, f'(x)-знакопостійна

580 Запитання . З якої умови визначається нерухомий кінець відрізка в методі хорд для розвязування рівняння f(x)=0
а) f(x0)f''(x0)>0

581 Запитання . Коли припиняються обчислення у методі хорд
а) |Xn+1-Xn|<eps

582 Запитання . Які умови придатності методу Ньютона (дотичних) для наближеного рішення рівняння f(x)=0?
а) f(a)f(b)<0; f'(x), f''(x)-знакопостійні

583 Запитання . Як вибирається нульове наближення у методі дотичних для рівняння f(x)=0?
а) f(x0)f''(x0)>0

584 Запитання . Яка з формул відноситься до методу дотичних?
а) Xn+1=Xn-f(Xn)/f'(Xn)

585 Запитання . Як перетвориться вихідне рівняння f(x)=0 для методу ітерацій?
а) x=fi(x)

586 Запитання . Які умови збіжносі методу ітерацій для рівняння x=fi(x)
а) fi(x)є[a,b],|fi'(x)|<1, x є [a,b]

587 Запитання . Чи буде сходитись метод ітерації (для рівняння) на відрізку [a,b], якщо початкове наближення вибрати наступним способом?
а) x0-довільна точка є [a,b]

588 Запитання . Яким образом метод ітерації сходиться до кореня рівняння на відрізку [a,b], якщо |fi(x)|<1, fi'(x)>0 і fi(x) є [a,b]
а) по "східці"

589 Запитання . Чому дорівнює довжина відрізків, що утворюються у методі половинного ділення?
а) (b-a)/2^n

590 Запитання . Як ставиться задача Коші для звичайного диференціального рівняння 1-го порядку?
а) {y'(x)=f(x,y), y(x0)=y0}

591 Запитання . Яка формула відноситься до методу Ейлера для рішення задачі Коші?
а) y_n+1=yn+hf(xn,yn)

592 Запитання . Чому дорівнює похибка в методі Ейлера?
а) O(h^2)

593 Запитання . Яка з формул для наближення розвязання задачі Коші більш точна?
а) Адамса

594 Запитання . З яких умов визначаються невідомі коефіцієнти загальних формул Рунге-Кутта? тут fi(h)- похибка методу, а h -його крок.
а) fi(0)=0, fi^n(0)=0, n=1,2,...

595 Запитання . Скільки формул Рунге-Кутта можна побудувати для наближеного розвязання задачі Коші?
а) незлічені множини

596 Запитання . Яка з формул Рунге-Кутта має похибку O(h^5)?
а) y_n+1=yn+(k1+2k2+2k3+k4)/6

597 Запитання . До яких методів відносяться формули Рунге-Кутта для розвязання задачі Коші?
а) однокроковим

598 Запитання . До яких методів відносяться методи Ейлера, Рунге-Кутта для розвязання задачі Коші?
а) наближеним чисельним

599 Запитання . На чому засноване правило Рунге для оцінки похибки обчислень при розвязання задачи Коші для звичайного диференціального рівняння 1-го порядку?
а) подвійний обрахунок

600 Запитання . У чому полягає сутність чисельних методів розвязання задачі Коші?
а) обчислення значень функції, що шукають у точках заданого відрізка

601 Запитання . Метод половинного ділення використовується для 
а) рішення рівняння

602 Запитання . Яка умова накладається на функцію f(x) на кінцях відрізків [an,bn], що виходять в методі половинного ділення?
а) f(an)f(bn)<0

603 Запитання . Яке з приведених рівнянь є трансцендентним?
а) x+tgx+2lnx+81.7=0

604 Запитання . Як визначається корінь k-ої кратності x=pci для рівняння f(x)=0 
а) f(pci)=f'(pci)=..=f^(k-1)(pci)=0

605 Запитання . Що таке відділення коренів для рівняння f(x)=0
а) знаходження відрізків, да є один корінь рівняння

606 Запитання . Що таке уточнення коренів для рівняння f(x)=0?
а) обчислення коренів с насамперед заданою точністю

607 Запитання . Що вибирається за чергове приближення до кореня рівняння f(x)=0 в методі хорд?
а) точка перетинання прямої, що зьєднує кінці дуги y=f(x) в звіссю Ох

608 Запитання . Що вибирається за чергове приближення до кореня рівняння f(x)=0 в методі дотичних?
а) точка перетинання дотичної до кривої y=f(x)з віссю Ох 

609 Запитання . У чому полягає графічний засіб відділення коренів?
а) приблизне відділення відрізків, де є корені рівняння f(x)=0

610 Запитання . Як себе веде функція f(x) якщо, на відрізку [a,b] єдиний корінь рівняння
а) f'(x)-знакопостійна на [a,b]

611 Запитання . Який вигляд має рівняння хорди, що проходить через точки  і ?
а) (x-a)/(b-a)=(y-f(a))/(f(b)-f(a))

612 Запитання . Яке з приведених рівнянь є алгібраїчним?
а) x^7+9.1x^5+8.3x^4+2x-3=0

613 Запитання . Який вигляд має рівняння дотичної, що проведена через точку (x0, f(x0))
а) y-f(x0)=f'(x0)(x-x0)

614 Запитання . До яких методів відноситься формула Ейлера для вирішення задачі Коші?
а) одношагових

615 Запитання . До яких методів відносяться формули Адамса для вирішення задачі Коші?
а) багатошаговим

616 Запитання . Виведення формули для похибки інтерполяції за допомогою інтерполяційного многочлена Лагранжа заснований на застосуванні теореми
а) Ролля

617 Запитання . Наближення функції у точці x=x* називають екстарполяцією, якщо x=x* розташована 
а) поза таблицею вузлів

618 Запитання . Наближення функції на сітці вузлів Xi=X0+ih, i=0,..,n називається власне інтерполяцією, якщо точка x=x* розташована 
а) всередині таблиці вузлів 

